package ru.network.anonymizer_msgs.type;

public enum GamePhase {
    FIRST_NIGHT,    // Первая ночь (знакомство и свободное общение мафии)
    FIRST_DAY,    // Первая ночь (знакомство и свободное общение мафии)
    DAY,            // День (обсуждение и голосование)
    NIGHT,          // Последующие ночи (тишина для мафии, только скрытные клики/выстрелы)
    DON_SHERIFF_NIGHT,          // Последующие ночи (тишина для мафии, только скрытные клики/выстрелы)
    FINISHED,          // Последующие ночи (тишина для мафии, только скрытные клики/выстрелы)
}
